user/tutorials/Nike/C12H26TML/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12288;
        startFace       24320;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12288;
        startFace       36608;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          192;
        startFace       48896;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          192;
        startFace       49088;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            patch;
        nFaces          64;
        startFace       49280;
    }
    top
    {
        type            patch;
        nFaces          64;
        startFace       49344;
    }
)

// ************************************************************************* //
