user/tutorials/Nike/C12H26TML/0/CO
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.00015";
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 0 0 0 0 0];

internalField   #codeStream
{
    
        codeInclude
        #{
            #include "fvCFD.H"
        #};
        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
        #};  
        codeLibs
        #{
            -lmeshTools \
            -lfiniteVolume
        #};
        code
        #{
            const IOdictionary & d = static_cast<const IOdictionary&>(dict);
            const fvMesh& mesh = refCast<const fvMesh>(d.db());
            const scalar PI = 3.1415926535897932384626;

            double dx=0.0002;//2.159e-5;
            double thickness =dx/7.29;//dx/29.16;//5.901;
            double Ctop=0.0001;//0.999;//0.0001;
            double Cbottom=0.0001;//0.9998;

            double WMC=86.1754;
            double WMN=28.0134;

            scalarField CO(mesh.nCells());
            forAll(CO, i)
            {
                const scalar z = mesh.C()[i][2];
                double a = 0.5*(1+erf(sqrt(PI)*z/thickness));
                double X=(Ctop*a+Cbottom*(1-a));

                //CO[i] =WMC*X/(WMC*X+WMN*(1-X));//0.5*(Ctop+Cbottom)+0.5*(Ctop-Cbottom)*erf(sqrt(PI)*z/thickness)
                CO[i] = 0.5*(Ctop+Cbottom)+0.5*(Ctop-Cbottom)*erf(sqrt(PI)*z/thickness);//
                
            }
            CO.writeEntry( "", os);
        #};
    
};

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
